In [1]:
import random
import pandas as pd

In [2]:
import numpy as np

In [3]:
np.random.seed(10)
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)

Original DataFrame:
          0         1
0  1.331587  0.715279
1 -1.545400 -0.008384
2  0.621336 -0.720086
3  0.265512  0.108549
4  0.004291 -0.174600
5  0.433026  1.203037
6 -0.965066  1.028274
7  0.228630  0.445138
8 -1.136602  0.135137
9  1.484537 -1.079805

In [4]:
part_70 = df.sample(frac=0.7,random_state=1)#random_state is used to maintain consistency values will be same for all time
part_70

          0         1
2  0.621336 -0.720086
9  1.484537 -1.079805
6 -0.965066  1.028274
4  0.004291 -0.174600
0  1.331587  0.715279
3  0.265512  0.108549
1 -1.545400 -0.008384

In [5]:
part_30=df.drop(part_70.index)

In [6]:
part_30

          0         1
5  0.433026  1.203037
7  0.228630  0.445138
8 -1.136602  0.135137

In [7]:
from dateutil.parser import parse

In [8]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String Date:")
print(s)

String Date:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

In [9]:
s.map(lambda x:parse(x))

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

In [10]:
##or we can also do the following
pd.to_datetime(s)

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

In [11]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)

In [12]:
df['col1'].tolist()

[1, 2, 3]

In [13]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)

In [14]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [15]:
#Row where the column has max value
for i in df.columns:
    print("In "+i+" row:",df[i].argmax())

In col1 row: 4
In col2 row: 3
In col3 row: 2

In [16]:
##new adding new column to the data frame at specified index
df.insert(3,column='col4',value=[121,124,242,342,55
                            ])

In [17]:
df

   col1  col2  col3  col4
0     1     4     7   121
1     2     5     8   124
2     3     6    12   242
3     4     9     1   342
4     7     5    11    55

In [18]:
#groupby columns in dataframe
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
df.groupby('col1')['col2'].apply(list)

Original DataFrame

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

In [19]:
#select all columns except mentioned column without using del
df.loc[:,df.columns!='col2']

  col1
0   C1
1   C1
2   C2
3   C2
4   C2
5   C3
6   C2

In [20]:
df.insert(2,column='col3',value=[7,6,5,4,3,2,1])

In [21]:
df

  col1  col2  col3
0   C1     1     7
1   C1     2     6
2   C2     3     5
3   C2     3     4
4   C2     4     3
5   C3     6     2
6   C2     5     1

In [22]:
##getting topmost n records of dataframe
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)

In [23]:
df.nlargest(3,df.columns)  ##use df.nlargest(n,'column-n') for n columns ntimes

   col1  col2  col3
4     7     5    11
3     4     9     1
2     3     6    12

In [24]:
df1=df.loc[3:]

In [25]:
df1

   col1  col2  col3
3     4     9     1
4     7     5    11

In [26]:
##adding prefix and suffix to the column names
df=df.add_prefix('A_')
df=df.add_suffix('_B')

In [27]:
df

   A_col1_B  A_col2_B  A_col3_B
0         1         4         7
1         2         5         8
2         3         6        12
3         4         9         1
4         7         5        11

In [28]:
##reversing order of rows and columns
df.loc[:,::-1]#column reversal

   A_col3_B  A_col2_B  A_col1_B
0         7         4         1
1         8         5         2
2        12         6         3
3         1         9         4
4        11         5         7

In [29]:
#row reversal
df.loc[::-1]

   A_col1_B  A_col2_B  A_col3_B
4         7         5        11
3         4         9         1
2         3         6        12
1         2         5         8
0         1         4         7

In [30]:
#printing columns based on datatypes
df.select_dtypes('object') ## for integer replace object with number

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [31]:
##query() in pandas

In [32]:
w=df['A_col1_B'].max()

In [33]:
df

   A_col1_B  A_col2_B  A_col3_B
0         1         4         7
1         2         5         8
2         3         6        12
3         4         9         1
4         7         5        11

In [34]:
df.query('A_col1_B <@w')

   A_col1_B  A_col2_B  A_col3_B
0         1         4         7
1         2         5         8
2         3         6        12
3         4         9         1

In [35]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}

In [36]:
df=pd.DataFrame(nums)

In [ ]:
df['amount']=